import requests
import pandas as pd
import numpy as np

url = 'https://www.beeftochina.com.cn/api/SystemApi/GetBeefWebDataTwoChart'
headers = {
    'user-agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/95.0.4636.4 Safari/537.36'
}
jsonData = {"MessageID": "32827c89-b900-4d83-88b4-7eabaf40b71f", "MessageType": 2000000003,
            "Data": {"UserID": "danaodaiyangyang", "LanguageCode": "zh-CN", "IsFirst": False, "Origin": "巴西",
                     "Destination": "土耳其|美国|哈萨克斯坦|留尼汪岛|科麦隆", "Type": "总计", "Storage": "总计", "Feeding": "总计",
                     "isEn": False}}

response = requests.post(url=url, headers=headers, json=jsonData).json()['Data']['Row']['series']
print(response[1]['data'])
df = pd.DataFrame(columns=['美国'])
df['美国'] = response[1]['data']
df['美国']  =df['美国'].replace(np.nan,' ')
print(df)

# j = []
# l = ['总计', '中国大陆', '中国香港', '埃及', '智利', '阿联酋', '伊朗', '沙特阿拉伯', '菲律宾', '俄罗斯', '意大利', '以色列', '乌拉圭', '新加坡', '约旦', '荷兰', '土耳其', '美国', '黎巴嫩', '阿尔及利亚', '阿根廷', '利比亚', '西班牙', '巴勒斯坦', '马来西亚', '德国', '印度尼西亚', '阿尔巴尼亚', '安哥拉', '伊拉克', '格鲁吉亚', '英国', '塞尔维亚', '卡塔尔', '巴拉圭', '秘鲁', '加蓬', '其他', '尼日尔', '瑞典', '泰国', '越南', '瑞士', '阿鲁巴', '突尼斯', '库拉索', '阿曼', '南非', '巴林', '马其顿', '葡萄牙', '澳大利亚', '科特迪瓦', '韩国', '亚美尼亚', '科威特', '古巴', '加拿大', '巴哈马', '利比里亚', '科摩罗', '波多黎各', '土库曼斯坦', '比利时', '百慕大群岛', '希腊', '塞舌尔', '毛里求斯', '缅甸', '佛得角', '阿塞拜疆', '马尔代夫', '摩洛哥', '加纳', '塞内加尔', '刚果（金）', '丹麦', '芬兰', '法国', '刚果（布）', '赤道几内亚', '玻利维亚', '巴拿马', '马绍尔群岛', '挪威', '中非共和国', '圣马丁岛', '格林纳达', '黑山', '爱尔兰', '文莱', '马耳他', '坦桑尼亚', '安提瓜和巴布达', '塔吉克斯坦', '纳米比亚', '中国澳门', '加那利群岛', '塞浦路斯', '印度', '荷属安的列斯群岛', '乌克兰', '多米尼加', '老挝', '吉布提', '洪都拉斯', '几内亚', '波内赫、圣尤斯特歇斯和萨巴', '莫桑比克', '格拉纳达', '所罗门群岛', '海地', '毛里塔尼亚', '苏里南', '中国台湾', '哈萨克斯坦', '留尼汪岛', '科麦隆', '阿富汗', '摩纳哥', '斯里兰卡', '日本', '塞拉利昂', '马里', '英属维尔京群岛', '开曼群岛', '圣多美与普林希比', '马恩岛', '冰岛', '巴巴多斯', '圭亚那', '伯利兹', '直布罗陀', '圣维森特和格拉纳丁斯', '波黑', '拉脱维亚', '克罗地亚', '巴西', '图瓦卢', '哥伦比亚', '保加利亚', '巴基斯坦', '卢森堡', '波兰', '福克兰群岛', '斯威士兰', '罗马尼亚', '斯洛伐克', '孟加拉国', '马达加斯加', '朝鲜', '瓦努阿图', '基里巴斯', '蒙古国', '泽西岛']
# for i in range(len(l)):
#     if i%5==0 and i!=0:
#         s = '|'.join(l[i:i+5])
#         j.append(s)
#     elif i==0:
#         s = '|'.join(l[i:i + 5])
#         j.append(s)
# print(j)
