import json
import random
import time
from datetime import datetime
from ..items import ZhongguonongyebushujuchaxunItem
import scrapy

# custom_settings = { 'DOWNLOAD_DELAY': 0.2, 'CONCURRENT_REQUESTS_PER_IP': 4, 'DOWNLOADER_MIDDLEWARES': {}, }

class ZgnybsjcxSpider(scrapy.Spider):
    name = 'zgnybsjcx'
    allowed_domains = ['http://zdscxx.moa.gov.cn/']
    # start_urls = ['http://http://zdscxx.moa.gov.cn//']

    def start_requests(self):
        item = ZhongguonongyebushujuchaxunItem()
        # 地区列表
        areaList = ['', '全球', '全国', '全国平均', '北京', '天津', '河北', '山西', '内蒙古', '辽宁', '吉林', '黑龙江', '上海', '江苏', '浙江', '安徽',
                    '福建', '江西', '山东', '河南', '湖北', '湖南', '广东', '广西', '海南', '重庆', '四川', '贵州', '云南', '西藏', '陕西', '甘肃',
                    '青海', '宁夏', '新疆', '全国(省份平均)']
        # 数据来源
        sourceList = ['', '国家发展改革委', '农业农村部市场与信息化司', '海关总署', '国家统计局', '农业农村部信息中心', '联合国粮农组织', '农业农村部农村合作经济指导司',
                      '国家统计局、农业农村部畜牧兽医局', '农业农村部渔业渔政局', '农业农村部市场与信息化司、农业农村部信息中心', '农业农村部300个价格监测网点县', '中国饲料工业协会',
                      '其他来源']
        # 指标名称
        indexList = ['', '每50公斤主产品总成本', '产量', '每头(或百只)死亡损失费', '每头(或百只)物质与服务费用', '每头(或百只)医疗防疫费', '畜群期内出栏(出售、自食)产值',
                     '饲料、饲盐费', '每头(或百只)人工成本', '每头(或百只)家庭用工折价', '每百头总成本', '每50公斤主产品净利润', '每百头副产品产值', '每头(或百只)煤费', '数量',
                     '每头(或百只)副产品产值', '每头(或百只)销售费', '每百头生产成本(按统一工价)', '每头(或百只)电费', '每50公斤主产品生产成本(按统一工价)', '每百头净利润',
                     '每头(或百只)总成本', '每头(或百只)生产成本(按统一工价)', '每百头产值合计', '每百头产品畜产值', '每头(或百只)财务费', '每50公斤主产品平均出售价格',
                     '累计出口数量', '当月出口数量', '其它直接费用', '修理维护费', '平均饲养天数', '每头(或百只)直接费用', '每核算单位用工数量', '当月出口金额', '累计进口金额',
                     '累计出口金额', '每头(或百只)工具材料费', '每头(或百只)精饲料费', '草场建设费', '固定资产折旧', '每头(或百只)主产品产值', '每头(或百只)主产品产量',
                     '累计进口数量', '当月进口数量', '饲草费', '批发价', '贸易量', '出栏量', '零售价', '每头(或百只)劳动日工价', '每50公斤毛(绒)总成本', '耗粮数量',
                     '精饲料数量', '每头(或百只)燃料动力费', '每头(或百只)管理费', '每头(或百只)产值合计', '每头(或百只)固定资产折旧', '每头(或百只)保险费', '每百头人工成本',
                     '每头(或百只)水费', '每百头产品畜数量', '每头产品畜平均活重', '每头(或百只)雇工费用', '每头(或百只)净利润', '每头(或百只)青粗饲料费', '每头(或百只)间接费用',
                     '每头(或百只)雇工工价', '每头(或百只)成本利润率', '每头(或百只)雇工天数', '每头(或百只)其他直接费用', '仔畜重量', '每头(或百只)饲料加工费', '当月进口金额',
                     '每头(或百只)家庭用工天数', '家庭用工天数', '家庭用工折价', '雇工工价', '每头(或百只)技术服务费', '每头(或百只)修理维护费', '每头(或百只)土地成本',
                     '每头(或百只)仔畜进价', '雇工费用', '每头(或百只)其它燃料动力费', '饲料加工费', '医疗防疫费', '每头总成本（活重）', '劳动日工价', '保险费', '雇工天数',
                     '配种费', '放牧用具费', '死亡损失费', '每头平均出售价格(活重)', '每百头成本利润率', '每百头毛(绒)产值', '每50公斤产品畜(活重)总成本', '每百头物质与服务费用',
                     '每百头雇工费用', '每50公斤毛(绒)平均出售价格', '每百头毛(绒)产量', '每百头土地成本', '市场价', '每百头家庭用工折价', '技术服务费',
                     '畜群期内出栏(出售、自食)数量', '间接费用', '销售费', '每百头成本纯收益率(按统一工价)', '直接费用', '财务费', '管理费', '燃料动力费', '存栏量',
                     '每50公斤主产品平均出售价', '幼畜购进费']
        for perArea in areaList:
            for perSource in sourceList:
                for perIndex in indexList:
                    for pageNum in range(1, 30):
                        try:
                            url = 'http://zdscxx.moa.gov.cn:8080/nyb/getHotWordData'
                            headers = {
                                'Referer': 'http://zdscxx.moa.gov.cn:8080/nyb/pc/search.jsp',
                                'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/93.0.4577.8 Safari/537.36',
                                'X-Requested-With': 'XMLHttpRequest',
                            }
                            data = {'page': str(pageNum),
                                    'rows': '20',
                                    'tag': '{"content":"农业统计信息","table":"COMMON_FACT","product":["小规模奶牛##畜禽产品(肉、禽、蛋、奶,畜产品)##成本收益","猪牛羊肉##肉类产量##农业生产","牛肉##畜禽产品##农业生产","散养肉牛##畜禽产品(肉、禽、蛋、奶,畜产品)##成本收益","中规模奶牛##畜禽产品(肉、禽、蛋、奶,畜产品)##成本收益","畜禽存栏数(年末数)_牛##年末存栏##农业生产","猪牛羊禽肉##畜产品##农业生产","牛肉##畜禽产品##价格","牦牛##畜禽产品(肉、禽、蛋、奶,畜产品)##成本收益","散养奶牛##畜禽产品(肉、禽、蛋、奶,畜产品)##成本收益","牛肉##畜产品##农业生产","牛奶##奶类产量##农业生产","牛肉##肉类产量##农业生产","牛##养殖业##进出口贸易","去骨牛肉##畜禽产品##价格","大规模奶牛##畜禽产品(肉、禽、蛋、奶,畜产品)##成本收益","牛##畜禽产品(肉、禽、蛋、奶,畜产品)##成本收益","牛##畜产品##农业生产","牛肉贸易量##肉类##供需预测","牛奶##乳及制品##价格","牛肉产量##肉类##供需预测"],"item":["每百头副产品产值","每50公斤毛(绒)总成本","每头(或百只)家庭用工天数","精饲料数量","每头(或百只)青粗饲料费","每百头成本利润率","每头(或百只)雇工费用","每头(或百只)燃料动力费","平均饲养天数","每头(或百只)雇工工价","每头(或百只)管理费","配种费","每头(或百只)死亡损失费","家庭用工折价","零售价","草场建设费","饲草费","每头(或百只)副产品产值","数量","燃料动力费","当月进口数量","每头(或百只)煤费","每头(或百只)雇工天数","每头(或百只)间接费用","每百头总成本","出栏量","每头(或百只)土地成本","每头(或百只)成本利润率","每头(或百只)直接费用","每百头物质与服务费用","每百头净利润","雇工工价","销售费","耗粮数量","当月出口数量","累计进口数量","其它直接费用","每头(或百只)电费","每头(或百只)财务费","批发价","每头(或百只)保险费","雇工天数","技术服务费","每百头土地成本","当月出口金额","每50公斤主产品总成本","每百头雇工费用","每头(或百只)主产品产值","每头(或百只)总成本","每百头生产成本(按统一工价)","累计进口金额","直接费用","每百头毛(绒)产值","每头(或百只)家庭用工折价","每头(或百只)物质与服务费用","每50公斤主产品平均出售价格","每百头产品畜产值","存栏量","饲料加工费","放牧用具费","每头总成本（活重）","雇工费用","每头(或百只)医疗防疫费","间接费用","每头(或百只)生产成本(按统一工价)","市场价","每头(或百只)技术服务费","每头平均出售价格(活重)","当月进口金额","财务费","产量","每头(或百只)销售费","固定资产折旧","每50公斤主产品生产成本(按统一工价)","每百头人工成本","医疗防疫费","每百头产品畜数量","每头(或百只)仔畜进价","畜群期内出栏(出售、自食)数量","每百头产值合计","饲料、饲盐费","累计出口数量","仔畜重量","每头(或百只)饲料加工费","家庭用工天数","死亡损失费","每50公斤主产品平均出售价","每50公斤产品畜(活重)总成本","畜群期内出栏(出售、自食)产值","修理维护费","每50公斤毛(绒)平均出售价格","每头(或百只)固定资产折旧","每头(或百只)劳动日工价","保险费","每头(或百只)其它燃料动力费","每头(或百只)工具材料费","每头(或百只)精饲料费","每头(或百只)水费","每头(或百只)净利润","每百头毛(绒)产量","每核算单位用工数量","每头产品畜平均活重","劳动日工价","每百头家庭用工折价","幼畜购进费","每头(或百只)其他直接费用","每头(或百只)修理维护费","每头(或百只)产值合计","贸易量","每头(或百只)人工成本","每头(或百只)主产品产量","每百头成本纯收益率(按统一工价)","累计出口金额","每50公斤主产品净利润","管理费"],"area":["湖北","甘肃","广西","陕西","上海","重庆","河南","北京","山西","河北","吉林","宁夏","福建","江西","西藏","全国平均","安徽","云南","全国","海南","湖南","天津","全球","青海","四川","江苏","内蒙古","全国(省份平均)","贵州","广东","黑龙江","山东","辽宁","新疆","浙江"],"keyWord":"牛"}',
                                    'level': '',
                                    'time': '["2017-09-07","2021-09-07"]',
                                    'product': '',
                                    'item': perIndex,
                                    'area': perArea,
                                    'source': perSource,
                                    'format': ''
                                    }
                            # 地区
                            item['Carea'] = perArea
                            # 来源
                            item['Csource'] = perSource
                            # 指标名称
                            item['CindexName'] = perIndex
                            yield scrapy.FormRequest(url=url, headers=headers, callback=self.parse, dont_filter=True,
                                                     formdata=data, meta={'item': item})
                        except:
                            pass


    def parse(self, response):
        item = response.meta['item']
        jsonDataList = response.json()['result']['pageInfo']['table']
        for perJsonData in jsonDataList:
            try:
                # 时间
                item['Ctime'] = perJsonData['time']
            except:
                item['Ctime'] = ''
            try:
                # 品类
                item['product'] = perJsonData['product']
            except:
                item['product'] =''
            try:
                # 指标名称
                item['itemName'] = perJsonData['item']
            except:
                item['itemName'] =''
            try:
                # 指标类型
                item['itemType'] = perJsonData['item_type']
            except:
                item['itemType'] =''
            try:
                # 地区
                item['area'] = perJsonData['area']
            except:
                item['area'] =''
            try:
                # 周期
                item['Cperiod'] = perJsonData['period']
            except:
                item['Cperiod'] =''
            try:
                # 单位
                item['unit'] = perJsonData['unit']
            except:
                item['unit'] =''
            try:
                # 数值
                item['Cvalue'] = perJsonData['value']
            except:
                item['Cvalue'] =''
            # 插入时间
            item['insertTime'] = datetime.now().strftime('%Y-%m-%d %H:%M:%S')
            yield item
