# coding=gbk
import pymysql

conn = pymysql.Connect(user='root', password='123456', host='127.0.0.1', database='lan', port=3306)
cursor = conn.cursor()
l = ['牛脖骨', '羊胯骨', '肚包肉', '肚包脑', '羊蹄', '羔羊臀骨', '羔羊背骨', '羊蝎子', '牛胸肉', '牛肩肉', '牛脖肉', '牛腩', '牛板腱', '牛前腱', '牛胸部肋条', '牛胸肉',
     '牛上脑', '牛保乐肩', '牛嫩肩', '牛肩峰', '八件套', '精品八件套', '牛腩', '七件套', '脖肉', '背肩', '八件套背肩', '精品八件套', '胸肉', '宝乐肩', '板腱', '上脑',
     '脖肉', '板腱', '宝乐肩', '胸部肋条', '八件套', '嫩肩', '前腱', '板腱', '胸肉', '肩胛', '背肩', '脖肉', '肋条', '保乐肩', '前腱', '胸肉', '上脑心', '嫩肩',
     '胸肉', '羔羊排', '肩部肋条', '嫩肩', '牛霖', '前腱', '牛前', '肩肉', '后腱', '前腱', '粗修大米龙', '脖肉', '胸肉', '肩肉', '肩甲', '肩部勒条', '嫩肩', '板腱',
     '牛前腱', '肩肉', '肩甲', '脖肉', '嫩肩', '前腱', '板腱', '肩峰', '六切', '后腱', '龟腱', '前驱', '肋排', '板腱', '后三件套', '大米龙', '去盖针扒', '牛林',
     '六切', '背肩', '牛骨髓', '牛后三件套', '牛前', '牛后', '小米龙', '牛肚', '蹄筋', '百叶', '骨髓', '牛肚', '金肚', '蹄筋', '短筋', '牛鞭', '排腱', '解冻排',
     '西冷', '龟腱', '牛尾', '小肚', '金肚', '大脸', '前腱', '板腱', '脖肉', '保乐肩', '上脑心', '胸部肋条', '脖肉', '板腱', '板腱', '保乐肩', '上脑肋条', '前驱',
     '前驱', '后驱', '全牛余', '大米龙', '小米龙', '小排', '臀腰肉', '牛前', '嫩肩', '臀腰肉', '前腱', '肩胛', '脖肉', '胸肉', '背肩', '大条', '肋条', '板腱',
     '脖肉', '板建', '上脑心', '肥牛', '上方肥牛', '谷饲前胸', '精选西冷', '精选眼肉', '精选牛柳', '保乐肩心', '大上脑', '精选上脑', '精选上脑', '白杨领上脑', '极佳上脑',
     '上脑', '精选眼肉', '西冷', '眼肉', '板键', '胸口油', '短肋条', '长肋条', '精选外群', '白杨领外群', '精选翼板肉', '精选牛仔骨', '精选牛小排', '牛小排', '极佳牛小排',
     '极佳牛小排', '精选肩胛小排', '针趴', '碎肉', '谷饲牛脖骨', '进口牛碎肉', '小牛肉块', '精修去盖针扒', '牛后五件套', '精品八件套', '上脑肋条', '带骨脖肉', '带骨腱子', '背肩',
     '肥牛一号', '肥牛二号', '肥牛三号', '战斧', '谷饲前胸', '安格斯后胸', '日式肥牛', '针扒', '臀腰肉心', '前后龟排腱', '带腱心', '六件套', '嫩肩', '脖肉', '板腱',
     '保乐肩', '前胸', '上脑', '臀腰肉带尾', '金钱腱', '三肋牛腩', '厚裙', '外裙', '牛胸叉', '腹心肉', '小排肥牛', '牛窝骨', '带骨牛腱', '牛脖骨', '腰椎骨', '肋眼骨',
     '西冷骨', '胸骨', '牛蹄筋', '腿筋', '牛杂筋', '牛短筋', '牛窝骨', '带骨牛腱', '牛尾', '牛肾', '肩胛软骨', '脖骨', '背骨', '肋眼骨', '牛窝骨', '脊骨', '胸骨',
     '月牙骨', '牛脖骨', '牛胸骨', '牛肚', '拐骨', '棒骨', '牛腱子', '带骨牛腱', '星牌牛背骨', '脖骨', '五花', '安格斯精选大米龙', '安格斯精选保乐肩', '安格斯精选板腱',
     '精选牛腩排', '牛肉卷', '牛肉块', '酱卤牛肉', '牛腹肉', '臀腰肉带尾', '三肋牛腩', '牛肩锋', '安格斯谷饲', '安格斯谷饲西冷', '安格斯谷饲眼肉', '安格斯谷饲嫩肩', '安格斯谷饲板腱',
     '安格斯腹心肉', '安格斯牛腩排', '安格牛柳', '安格斯上脑', '腹部挑骨五花肉条', '厚肥膘', '碎膘', '薄脊膘', '奶脯皮', '大块倒37碎肉', '小块倒37碎肉', '带皮前上肉', '多肉前棒骨',
     '上脑芯', '三肋牛腩', '前后龟腱子', '板油', '带皮五花', '黑猪背膘', '一号肉', '二号肉', '三号肉', '四号肉', '前肘', '窝骨', '带腱心', '草饲热切脂肪', '冷切脂肪',
     '牛胯骨', '冷切牛脂肪', '热切牛脂肪', '草饲牛脂肪', '牛脂肪', '大条', '小条', '针趴拼柜', '多肉脖骨', '牛七件套', '安格斯谷饲眼肉', '牛腩排', '羊腿', '牛前七件套',
     '牛后五件套', '去盖针扒', '牛前六件套', '和牛', '囤腰肉心', '三角肉', '羔羊排尖', '羔羊带肉胸口骨', '羊脖筋', '羔羊板筋', '大羊脊骨', '羔羊肩骨', '羊脊骨片', '羊棒骨',
     '精修熟羊肉', '羊肚油', '熟羊油', '臀肉块', '羔羊睾丸', '羊蛋', '羔羊排', '方切肩', '四分体', '方肩', '法腿', '牛棒骨', '熟牛油', '牛腰油', '羔羊前腿', '牛颈脊骨',
     '小牛混合骨', '牛肾', '小牛肩膀肉', '犊牛腿肉', '小牛腿肉', '冰鲜', '牛霖', '肩胛', '后腱', '小瓜条', '辣椒条', '针趴', '上脑', '前胸', '大瓜条', '精修全牛',
     '六切', '臀腰肉心', '西冷眼肉拼柜', '羔羊前四分体', '绵羊肚', '羔羊法腿', '羔羊排', '大羊后腿包', '羔羊胯骨', '八件套', '胸部肋条', '肩部肋条', '带骨腱子', '和牛碎肉',
     '和牛脂肪', '上脑肋条', '带骨脖肉', '胸腩连体', '全牛单品', '牛腹肉', '尾龙趴', '臀尾', '胸腩连体', '辣椒条', '精八', '牛后五件套', '羊胯骨', '肚包肉', '肚包脑',
     '羊蹄']
s = set(l)
print(len(s))
print(list(s))
for i in s:
    sql = 'insert into goods(goodsName)values (%s)'
    cursor.execute(sql, i)
    conn.commit()
conn.close()
